Repository: KDE/kblackbox
Catalog: po/*/kblackbox.po
Languages: uk

# NAME OF TRANSLATORS
source: Your names
uk: Eugene Onischenko,Іван Петрущак

# EMAIL OF TRANSLATORS
source: Your emails
uk: oneugene@ukr.net,ivanpetrouchtchak@yahoo.com

# A number between 1 and 99 is displayed in front of it.
source: ball
uk: кулька

# A number between 2 and 30 is displayed in front of it.
source: column
uk: стовпчик

# A number between 2 and 30 is displayed in front of it.
source: row
uk: рядок

# Difficulty level title
source: Configurable
uk: Нетиповий

source: Start Tutorial
uk: Почати навчання

source: Start tutorial
uk: Почати навчання

source: <qt>The <b>tutorial</b> is a fast, user friendly and interactive way to learn the rules of the game. Start it if you do not know them!</qt>
uk: <qt><b>Підручник</b> є швидким, дружнім до користувача та інтерактивним шляхом вивчення правил гри. Почніть з нього, якщо ви не знаєте їх!</qt>

source: New Sandbox Game
uk: Нова гра у Пісочниці

source: Start a new sandbox game
uk: Почати нову гру у Пісочниці

source: <qt><p>In a <b>sandbox game</b>, the solution is displayed at the beginning of the game. This is useful to understand the game principles.</p><p>However: after a while, it is not really fun and you should try to start a real game!</p></qt>
uk: <qt><p>У <b>грі у пісочниці</b>, розв’язок відображається на початку гри. Це корисно для розуміння принципів гри.</p><p>Але: трохи згодом це стає не так весело, вам слід почати справжню гру!</p></qt>

# This is the last action of a game to check the result, when the user is done.
source: Done!
uk: Готово!

source: <qt><ul><li>First, you have to place all the balls on the black box. To guess the correct positions of the balls and see how they interact with laser beams, you should use the lasers that are positioned around the black box.</li><li><b>When you think you are done</b>, you should click here.</li></ul><p>Note that it is only possible to click here if you have placed the correct number of balls.</p></qt>
uk: <qt><ul><li>Перш за все, слід розмістити кульки у чорній скриньці. Щоб знайти правильно розташування кульок та подивитися як вони взаємодіють з лазерними променями, вам потрібно використати лазери, розташовані на стінках чорної скриньки.</li><li><b>Коли ви завершите</b>, вам слід натиснути цю кнопку.</li></ul><p>Зауважте, що її натискання можливе, лише якщо ви розташували правильну кількість кульок.</p></qt>

source: Give up the game
uk: Здатися

source: <qt><p>Choose "<b>Solve</b>" if you want to give up the current game. The solution will be displayed.</p><p>If you placed all the balls and do not want to give up, choose "Done!".</p></qt>
uk: <qt><p>Оберіть «<b>Розв’язати</b>», якщо ви здаєтеся у поточній грі. В результаті ви побачите розв’язок.</p><p>Якщо ви розташували всі кульки і не бажаєте здаватися, оберіть «Готово!».</p></qt>

source: Enable highlight under mouse
uk: Увімкнути підсвічування під вказівником

source: Move Down
uk: Пересунути вниз

source: Move Up
uk: Пересунути вгору

source: Move Left
uk: Пересунути ліворуч

source: Move Right
uk: Пересунути праворуч

source: Switch Ball or Shoot Laser
uk: Перемкнути кульку або стріляти лазером

source: Switch Marker
uk: Перемкнути позначку

source: Note: You can change<br />the parameters of<br />custom games in the<br />Settings dialog.
uk: Зауваження: Ви можете змінити<br />параметри власної<br />гри у діалоговому вікні<br />налаштування.

source: First, you need to remove 1 ball from the black box.
uk: Спочатку, вам потрібно вилучити %1 кульку з чорної скриньки.

source: To check if you successfully guessed the ball positions, click here!
uk: Щоб перевірити чи вірно ви визначили розташування кульок, натисніть тут!

source: You need to place 1 more ball on the black box.
uk: Вам потрібно розташувати ще %1 кульку у чорну скриньку.

source: Game over.
uk: Гру завершено.

source: Game paused.
uk: Гру призупинено.

source: Clicking on "Done!" is the normal way to check the positions of the balls at the end of the game. However, it is not possible in the tutorial to end the game before you reached the last step. Please first finish the tutorial.
uk: Клацання по кнопці «Готово!» звичайний шлях перевірки вірності розташування кульок наприкінці гри. Але у підручнику неможливо завершити гру до того моменту, коли ви досягнете останнього кроку. Будь ласка, спочатку завершіть навчання за підручником.

source: Check positions
uk: Перевірити розташування

source: Your final score is: %1.<br />You did really well!
uk: Ваш рахунок : %1.<br />Дуже гарна гра!

source: But it does not count<br />because <b>it is the sandbox!</b>
uk: Але це не має значення,<br />оскільки це <b>гра у пісочниці!</b>

source: Your final score is: %1.<br />I guess you need more practice.
uk: Ваш рахунок : %1.<br />Думаю, що вам треба більше тренуватися.

source: Game paused.<br />Press "%1" to resume.
uk: Гру призупинено.<br />Натисніть «%1», щоб її поновити.

source: Do you want to cancel the current custom game and start a new one with the new parameters?
uk: Ви справді бажаєте вийти з поточної гри і розпочати нову з новими параметрами?

# @action:button
source: Start New Game
uk: Почати нову гру

source: Custom Game
uk: Нетипова гра

source: Sorry, you may not give up during the tutorial.
uk: Вибачте під час навчання здаватися не можна.

source: Solve
uk: Розв’язати

source: You placed all the balls. Great! You should now click on "Done!" to end the game and check if you guessed correctly. So, do you really want to give up this game?
uk: Ви розташували всі кульки. Чудово! Тепер вам слід натиснути на кнопку «Готово!», щоб завершити гру і перевірити чи ви вірно вгадали. Отже, чи справді ви бажаєте здатися?

source: Give up
uk: Здатися

source: You should place %1 ball!
uk: Вам ще слід розташувати %1 кульку!

source: You have placed %1.
uk: Ви розташували %1.

source: Do you really want to give up this game?
uk: Ви дійсно хочете здатися у цій грі?

source: Note: In the sandbox mode,<br />the solution is already displayed.<br />Have fun!
uk: Зауваження: У режимі Пісочниці,<br />розв’язок уже показано.<br />Розважайтесь!

source: This will be the end of the current game!
uk: Це приведе до закінчення гри!

source: Start new game
uk: Почати нову гру

source: Score
uk: Рахунок

source: <qt><p>This is <b>your score</b>. You should try to get the lowest possible.</p><p>The score increases:<ul><li>with time: <b>1 point</b> per second.</li><li>with the use of lasers:<ul><li><b>3 points</b> if the laser beam hits a ball or exits at the entry point,</li><li><b>9 points</b> if it exits at another entry point.</li></ul></li></ul></p><p>Your score is set to <b>999</b> at the end of the game if you make a mistake.</p></qt>
uk: <qt><p>Це <b>ваш рахунок</b>. Вам слід намагатися набрати якомога менше балів.</p><p>Рахунок збільшується:<ul><li>з часом : <b>1 бал</b> на секунду.</li><li>з використанням лазерів:<ul><li><b>3 бали</b> якщо лазерний промінь влучить у кульку або вийде у точці входу,</li><li><b>9 балів</b> якщо він вийде у інші точці входу.</li></ul></li></ul></p><p>Ваш рахунок стане <b>999</b> балів, якщо наприкінці гри виявиться, що ви зробили помилку.</p></qt>

source: <qt><p>This is the <b>main game area</b>.</p><ul><li>The <b>black box</b> is in the center.</li><li>On the left, there are the <b>balls</b> you have to place over the black box.</li><li>Around the black box, there are <b>lasers</b> that are replaced with <b>interaction information</b> if you use them.</li></ul></qt>
uk: <qt><p>Це <b>головна область гри</b>.</p><ul><li><b>Чорну скриньку</b> розміщено по центру.</li><li>Ліворуч знаходяться <b>кульки</b>, які вам слід розташувати у чорній скриньці.</li><li>Навколо чорної скриньки розміщено <b>лазери</b>, які змінюватимуться на <b>інформацію про взаємодію</b>, якщо ви використаєте їх.</li></ul></qt>

source: Tutorial
uk: Навчання

source: Displays the progress of the tutorial.
uk: Відображає процес проходження підручника.

source: Describes what you should do to reach the next tutorial step.
uk: Пояснює, що вам слід робити, щоб перейти до наступного кроку підручника.

# Previous tutorial step
source: &Previous
uk: &Попередн.

source: Go back to the previous tutorial step.
uk: Повернутися до попереднього кроку підручника.

# Next tutorial step
source: &Next
uk: &Наступн.

source: Go to the next tutorial step.
uk: Перейти до наступного кроку підручника.

source: Welcome!
uk: Ласкаво просимо!

source: This tutorial will teach you how to play KBlackBox, using a simple example.<br /><br />We are playing with a square black box of 6 columns and 6 rows. It has 3 balls <b>hidden</b> inside it and 24 laser probes around it.<br /><br />The goal is to <b>find the positions of the balls.</b>
uk: Цей підручник навчить вас грати у «Чорну скриньку» за допомогою простого прикладу.<br /><br />Отже, граємо з квадратною чорною скринькою з 6 стовпцями та 6 рядками. У ній знаходиться 3 <b>приховані</b> кульки, вздовж її периметру розміщено 24 лазери.<br /><br />Метою гри є <b>визначити розташування кульок.</b>

source: Click on "Next"
uk: Клацніть по кнопці «Далі»

source: Black box principles
uk: Засади Чорної скриньки

source: The balls are not visible, but we can shoot laser beams into the box at different entry points and observe if the laser beams leave the box, and if they do, where they come out.<br /><br />The laser beams interact with the balls in various ways.
uk: Кульки невидимі, але ми можемо обстрілювати їх лазерними променями всередині скриньки з різних вихідних точок і спостерігати за тим, чи виходять промені зі скриньки і, якщо так, куди саме вони спрямовані.<br /><br />Лазерні промені можуть взаємодіяти з кульками у декілька способів.

source: Please click on the marked laser to shoot a beam into the black box.
uk: Будь ласка, клацніть на позначеному лазері, щоб зробити постріл променем у чорну скриньку.

source: No interaction
uk: Без взаємодії

source: If a laser beam does not interact with any ball in the black box, it comes out at the point opposite the entry point.<br /><br />Example: Suppose we have 3 balls in the box as shown. They will not affect laser beam "1".<br /><br />As the game progresses, each pair of entry/exit points is marked with a different number.
uk: Якщо лазерний промінь не взаємодіє з жодною кулькою, він виходить зі скриньки у точці протилежній до точки входу.<br /><br />Приклад: Припустимо, що ми маємо 3 кульки у ящику, як це показано. Вони не мають впливу на лазерний промінь «1».<br /><br />З плином гри кожна пара вхідних/вихідних точок буде позначена різними номерами.

source: Now shoot the marked laser to discover the first kind of interaction.
uk: Тепер зробіть постріл позначеним лазером, щоб вивчити перший спосіб взаємодії.

source: Hit
uk: Влучення

source: A direct impact on a ball is called a "<b>hit</b>". A beam that hits a ball does <b>not</b> emerge from the black box.<br /><br />Example: The beam might have hit a ball at the position shown, but the exact position of the hit is not certain: There are many other possibilities.
uk: Прямий постріл у кульку називається «<b>влученням</b>». Промінь, що влучає у кульку, <b>не</b> відбивається від чорної скриньки.<br /><br />Приклад: Промінь може влучити у кульку у показаній позиції, але точне розташування кульки не визначається: існує багато інших можливостей.

source: Shoot the marked laser to discover the second kind of interaction.
uk: Зробіть постріл позначеним лазером, щоб вивчити другий спосіб взаємодії.

source: Simple deflection
uk: Просте відбиття

source: The interaction of a beam that does not actually hit a ball, but aims to one side of it, is called a "<b>deflection</b>". The angle of deflection of the beam is always <b>90 degrees</b>.<br /><br />Example: The ball shown would deflect beam "2" upward, as shown, but this is <b>not</b> the only possibility.
uk: Взаємодія, коли промінь не влучає прямо у кульку, але у одну з її сторін, називається «<b>заломленням</b>». Кут заломлення променя завжди дорівнює <b>90 градусам</b>.<br /><br />Приклад: Показана кулька заломлює промінь «2» вгору, як це показано, але це <b>не</b> є єдиною можливістю.

source: Click on "Next" to see another combination of ball positions that deflects the laser beam as shown.
uk: Натисніть кнопку «Далі», щоб побачити іншу комбінацію розташувань кульок, яка заломлює лазерний промінь так, як це показано.

source: Several deflections
uk: Багаторазове відбиття

source: As you can see, interactions in the black box can be quite complicated!<br />A laser beam entering and exiting at the positions "2" might have been deflected by this configuration of 3 balls.
uk: Як ви самі бачите, взаємодія з кульками всередині чорної скриньки може бути дуже складною!<br />Лазерний промінь, що входить і виходить у позиціях «2» може бути заломленим цією конфігурацією 3 кульок.

source: Shoot the marked laser to discover another kind of result.
uk: Зробіть постріл позначеним лазером, щоб вивчити іншу можливість.

source: Reflection
uk: Відбиття

source: If the laser beam leaves the black box <b>at the entry point</b>, it has been reflected backward inside the black box.<br /><br />Example: We have placed 2 balls for you in a configuration that would lead to such a reflection.
uk: Якщо лазерний промінь виходить з чорної скриньки <b>у точці входу</b>, його було відбито назад всередині скриньки.<br /><br />Приклад: Ось спеціально розташовані 2 кульки, які створюють таку схему відбиття.

source: Shoot the marked laser to see another backward reflection case.
uk: Зробіть постріл позначеним лазером, щоб побачити інший випадок зворотного відбиття.

source: Special reflection
uk: Особливе відбиття

source: If a ball is <b>at the edge of the box</b> (with no other ball nearby), a beam which is aimed into the black box directly beside it causes a backward reflection.<br /><br />Example: The configuration shown can cause a backward reflection.
uk: Якщо кулька знаходиться <b>на краю скриньки</b> (і поряд немає іншої кульки), промінь, який спрямовано у чорну скриньку у точці безпосередньо поряд з ним, буде відбито точно у точку виходу.<br /><br />Приклад: Показана конфігурація може спричинити таке зворотне відбиття.

source: Nearly done. Click on "Next".
uk: Майже все. Клацніть по кнопці «Далі».

source: Marker for "free position"
uk: Позначка для «вільна позиція»

source: We are sure there are no balls in the first 2 columns. If there were any, the beam entering at position "1" would hit a ball or be deflected by a ball in column 2. You can mark a "free position" with a right mouse click (see also keyboard shortcuts).<br /><br />Example: There are 12 markers in the first 2 columns.
uk: Отже, ми впевнилися, що у перших двох стовпцях кульок немає. Якщо б вони там були, промінь, що увійшов у позиції «1» влучив би у кульку або був би заломленим кулькою у другому стовпчику. Ви можете позначити «вільні позиції» за допомогою клацання правою кнопкою миші (погляньте також на клавіатурні скорочення).<br /><br />Приклад: Ви бачите відповідні 12 позначок у перших двох стовпчиках.

source: Click on "Next".
uk: Натисніть кнопку «Далі».

source: Marking balls
uk: Позначення кульок

source: When you have worked out where a ball is, please use the left mouse button to mark it. To remove a ball mark, use the left mouse button again. Last tip: If you are not sure about a position, you can use a right click on a ball to mark it as "unsure". (See also keyboard shortcuts.)<br /><br />Example: We marked one position as sure, the other one as unsure.
uk: Коли ви дізналися де саме розташовано кульку, позначте це місце за допомогою лівої кнопки миші. Щоб вилучити позначку, знову використайте ліву кнопку миші. Остання підказка: Якщо ви не впевнені щодо цієї позиції, ви можете використати праву кнопку миші зробивши на кульці позначку «неточно». (Перегляньте також клавіатурні скорочення.)<br /><br />Приклад: ми позначили одну позицію як таку, де є кулька, а іншу — як неточну.

source: Let us play!
uk: До гри!

source: <b>Congratulations!</b> You now know <b>all the rules</b> for KBlackBox.<br /><br /><b>You can start to play.</b> Try to finish this tutorial game by yourself!<br /><br />Tip: We have sent in enough beams to deduce the positions of the 3 balls with certainty. Of course, you can use some more shots if needed.
uk: <b>Вітання!</b> Тепер ви знаєте <b>всі правила</b> «Чорної скриньки».<br /><br /><b>Можете розпочати гру.</b> Спробуйте завершити цю навчальну гру самостійно!<br /><br />Підказка: Ми вже зробили достатньо пострілів, щоб точно визначити розташування всіх трьох кульок. Звичайно, ви можете зробити ще декілька пострілів, якщо це потрібно.

source: Finish placing the balls and click on "Done!" when you are done!
uk: Завершіть пошуки кульок, а потім натисніть кнопку «Готово!»

source: File of the current theme of the graphic elements. (SVGZ file with path and file extension)
uk: Файл поточної теми графічних елементів. (Файл SVGZ зі шляхом та суфіксом назви)

source: Number of balls for custom difficulty level
uk: Кількість кульок для рівня складності визначеного користувачем

source: Number of columns of the board for custom difficulty level
uk: Кількість стовпців у скриньці для рівня складності визначеного користувачем

source: Number of rows of the board for custom difficuty level
uk: Кількість рядків на дошці для рівня складності визначеного користувачем

source: KBlackBox
uk: Чорна скринька

source: Find the balls hidden in the black box by shooting laser beams!
uk: Знайдіть кульки, приховані у чорній скриньці, стріляючи по них лазерними променями!

source: (c) 2007, Nicolas Roffet (c) 1999-2000, Robert Cimrman
uk: © Nicolas Roffet, 2007 © Robert Cimrman, 1999–2000

source: Developer of version 0.4.
uk: Розробник версії 0.4.

source: Original developer
uk: Перший розробник

source: Artist
uk: Художник
